{
  "name":"Mallory Square",
  "description":"<p>Whether it’s a race, festival or an event, Mallory Square is Key West’s most popular meeting point.</p>",
  "image":{"url":"//cdn.traveltripper.io/site-assets/359_384_783/media/malory-lst.jpg"},
  "sort_order":6,
  "url":"/attractions/mallory-square/",
  "about":"<p>Whether it’s a race, festival or an event, Mallory Square is Key West’s most popular meeting point. Home to the nightly Key West Sunset Celebration, this plaza is located on the waterfront facing the Gulf of Mexico. With Duval Street as one of its borders, Mallory Square is always in the middle of the action, if not the host. That said, 24 North Hotel is just a hop, skip and a jump from Mallory Square, making an ideal stop during your Key West vacation.</p>\n\n<p>The <a href=\"https://www.mallorysquare.com/sunset-celebration/\" target=\"_blank\">sunset celebration</a> is the plaza’s claim to fame. The Key West sunset has always been breathtaking – deep oranges, light reds and corals, yet it was Mallory Square that started the party. Every evening, starting two hours before sunset, Mallory Square hosts Key West’s best street performers, artists, and musicians. </p>\n\n<p>Although the Sunset Celebration is one of Malloy Square’s main attractions, it’s also the central point for many Key West activities and prime people watching. It is  the viewing spot for the Wrecker’s Race to Sandy Key during the <a href=\"http://www.24northhotel.com/blog/unofficially-the-most-fun-in-key-west-conch-republic-independence-celebration/\" target=\"_blank\">Conch Republic Independence Celebration</a> and it is never without a character or two. Mallory Square is located next to the hotel’s shuttle stop making it the perfect place to catch the Key West vibe.</p>\n\n<p>Dominique the Cat Man might be the most surprising act of all. His <a href=\"http://www.catmankeywest.com/\" target=\"_blank\">cat circus</a> has cats jumping through rings, walking tight-ropes, and even leaping through fire. Training cats seems impossible enough, but getting house cats to jump through fire is a whole ‘nother animal. Another Sunset Celebration favorite is local musician Mustafa. When the sun begins to set you can count on the easygoing island tunes of this Key West favorite. His unique voice provides the perfect background for a Florida sunset.  </p>\n\n<p>While these are some of our <a href=\"https://www.mallorysquare.com/sunset-celebration-performers/\" target=\"_blank\">favorite performers</a>, there’s plenty more each night of the celebration. Among the tarot card readers, bible preachers, artisans selling their crafts, and food vendors offering local treats like key lime-ade, the sunset experience is as random and original as Key West itself. And no matter the performer, you can always expect a hefty dose of humor and a laid-back vibe. After all, this is the heart of Key West. </p>\n\n<p>Although the Sunset Celebration is one of Malloy Square’s main attractions, it’s still the central point for many Key West activities. For example, it’s the viewing spot for the Wrecker’s Race to Sandy Key during the <a href=\"http://www.24northhotel.com/blog/unofficially-the-most-fun-in-key-west-conch-republic-independence-celebration/\" target=\"_blank\">Conch Republic Independence Celebration</a>, and it’s also one spot close to the hotel that’s prime for people watching. Mallory Square is never without a character or two, making it the perfect place to catch the Key West vibe.</p>\n\n<p>Yet the plaza is also filled with <a href=\"https://www.mallorysquare.com/shopping/\" target=\"_blank\">great little shops</a>, as well. Sure, there are the usual souvenir shops that Old Town is known for, yet there are some gems worth dropping by. There’s the Key West Sponge Market, which sells natural sea sponges. There’s also the Shell Warehouse, filled with unique seashells and uncommon trinkets. Plenty of name brands have also set up shop in the area around Mallory Square. From Crocs to Kai Kai, Lily Pulitzer and <a href=\"http://rodriguezcigarskeywest.com/\" target=\"_blank\">Rodriguez Cigars</a>, you’re sure to find something for yourself and for those on your list. </p>\n",
  "other_info":"400 Wall Street<br>Key West, Florida 33040",
  "detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_783/media/malory-large.jpg"}
}
