{"name":"Dry Tortugas",
  "description":"<p>Located off the coast of Key West, Dry Tortugas National Park is the perfect island adventure.</p>",
  "image":{"url":"//cdn.traveltripper.io/site-assets/359_384_783/media/dry-tortugas.jpg"},
  "sort_order":1,
  "url":"/attractions/dry-tortugas/",
  "about":"<p>Located off the coast of Key West, Dry Tortugas National Park is the perfect island adventure. With some of the best snorkeling and diving in the area, as well as gorgeous beaches you won’t find anywhere else on Key West, <a href=\"https://www.nps.gov/drto/index.htm\" target=\"_blank\">Dry Tortugas</a> is a must on your vacation to-do list. To top it off, it’s also home to the historic Fort Jefferson, a strategic military port for the United States in the 19th century.</p>\n\n\t\t\t<p>Although the national park is located on a remote island 70 miles from Key West, 24 North Hotel is in the prime location to access this national park, which can only be reached by ferry or seaplane. Thanks to the <a href=\"http://www.24northhotel.com/pdf/shuttle-schedule.pdf\">24 North Hotel shuttle</a>, the Dry Tortugas <a href=\"https://www.drytortugas.com/\" target=\"_blank\">ferry access terminal</a> is just a few minutes away - as in two blocks from the hotel shuttle stop. The Dry Tortugas seaplane is even closer to the hotel, with <a href=\"http://keywestseaplanecharters.com/\" target=\"_blank\">Key West Seaplane Adventures</a> just down the street on Roosevelt Boulevard.</p> \n\n\t\t\t<p>Once you’ve made the short trip from the hotel to Dry Tortugas, there’s a plethora of activities to see and do. Snorkeling and diving are major pulls. In fact, the Dry Tortugas <a href=\"https://www.nps.gov/drto/planyourvisit/diving-and-snorkeling-sites.htm\" target=\"_blank\">multiple dive sites</a> are home to numerous species of coral, sharks and even squid. The Windjammer is an especially interesting dive site. Located on the site of the shipwreck of the Avanti, this ship was headed for Montevideo before it wrecked off the park’s coast in 1901. Now it’s the artificial reef for thousands of tropical fish.</p>\n\n\t\t\t<p>Another dive site of interest is the Texas Rock, in which you can find various types of coral, including the very rare black coral. In fact, the National Park Service states that this dive site harbors every type of stony coral except for Elkhorn and Staghorn, as the Texas Rock is part of a coral-growing program. Considering the amount of coral, this area of the Dry Tortugas is brimming with marine life. Check out the community of sea fans on the reef’s north side, as well.</p> \n\n\t\t\t<p>If you have the opportunity to stay until dark, the night dive at the Moat Wall gets the adrenaline flowing. Not only does night diving add an extra layer of intensity to the dive, it also brings out some marine life not often seen during the day – including the Dry Tortugas resident octopus and basket starfish. If that’s not enough adrenaline for you, head to the Pulaski Shoals Area, known for its colony of sharks such as hammerheads, bull sharks, nurse sharks and black tips.</p>\n\n\t\t\t<p>Aside from snorkeling and diving, Dry Tortugas has the serene beaches that island vacations are made of. With their turquoise hues and graduating shorelines, <a href=\"https://www.nps.gov/drto/planyourvisit/swimming-beaches.htm\" target=\"_blank\">the beaches</a> are an ideal place to layout in the sun, swim in crystal-clear water or spot a few fish with your snorkel gear. Garden Key and Loggerhead Key have especially scenic beaches and an abundance of wildlife, too. For those interested in history, there’s <a href=\"https://www.nps.gov/drto/learn/historyculture/fort-jefferson.htm\" target=\"_blank\">Fort Jefferson</a>, built by the US military starting in 1846. Although it was actively used until the 1930s, Fort Jefferson was never completely finished. Nevertheless, it held a few notable prisoners, including the conspirators behind Abraham Lincoln’s assassination.</p> \n\n\t\t\t<p>No matter your interest, Dry Tortugas National Park has enough activities to keep you busy for an entire day - or two. While Garden Key is open 24 hours, other areas of the Dry Tortugas close at sunset. Consult the <a href=\"https://www.nps.gov/drto/planyourvisit/hours.htm\" target=\"_blank\">National Park Service schedule</a> before planning your trip or call the park at <a href=\"tel:3052427700\">(305) 242-7700</a>.</p>\n",
  "other_info":"24.6285° N, 82.8732° W<br>Phone: (305) 242­7700",
  "detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_783/media/dry-tortugas-lg.jpg"}

}
