{"name":"San Carlos Institute","description":"<p>&nbsp;<span class=\"s1\">If you&rsquo;re interested in Key West&rsquo;s Cuban history, the San Carlos Institute is the place to start. Plus it's just a short walk from the 24 North Hotel shuttle!</span></p>","url":"/attractions/san-carlos-institute/","about":"<p class=\"p1\"><span class=\"s1\">If you&rsquo;re interested in Key West&rsquo;s Cuban history, the San Carlos Institute is the place to start. A short walk from the 24 North Hotel shuttle, the <a href=\"http://www.institutosancarlos.org/\" target=\"_blank\"><span class=\"s2\">San Carlos Institute</span></a> is easily the most recognizable building on <a href=\"http://www.24northhotel.com/attractions/duval-street/)\" target=\"_blank\"><span class=\"s2\">Duval Street</span></a>. However, this attraction is much more than its beautiful colonial fa&ccedil;ade.&nbsp; It&rsquo;s Key West&rsquo;s Cuban cultural center and museum, highlighting not only Cuba&rsquo;s rich history, but also the island&rsquo;s unique relationship with Key West. While Conchs often remark that Key West is only &ldquo;90 miles to Cuba,&rdquo; what many tourists don&rsquo;t realize is that Key West has had a much closer relationship to the island throughout history. In fact, by the 19</span><span class=\"s3\"><sup>th</sup></span><span class=\"s1\"> century, Cubans had made up one-third of the Key West population. That said, it&rsquo;s no surprise that the San Carlos Institute opened its doors in around that time.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">Founded in 1871 as a center to promote the language and culture of Cubans living in Key West, the San Carlos Institute became one of the first schools in the nation to teach in both English and Spanish. Yet even more revolutionary was the institute&rsquo;s influential role in the Cuban fight for independence from Spain. Fondly called <em>la Casa Cubana</em> by national hero Jos&eacute; Mart&iacute;, the San Carlos Institute was where Mart&iacute; organized Cuban exiles and planned the fight for independence in the late 19</span><span class=\"s3\"><sup>th</sup></span><span class=\"s1\"> century. Here, Mart&iacute; literally rallied the troops, garnering support from the entire <a href=\"http://www.24northhotel.com/blog/the-old-key-west/\" target=\"_blank\"><span class=\"s2\">Cuban community</span></a> in Key West.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">These days, the San Carlos Institute pays tribute to Mart&iacute;&rsquo;s profound influence on Cuba with its permanent exhibition &ldquo;The Life and Works of Jos&eacute; Mart&iacute;: 1853-1895,&rdquo; which features not only personal documents, but also photos and an audio-visual presentation of the intellectual&rsquo;s life and works.&nbsp; Other permanent exhibitions include &ldquo;The Pichs Collection: Exploring Cuba&rsquo;s History through its Postal Stamps,&rdquo; which is a joint project by the Smithsonian and the San Carlos Institute that explores the correspondence between Cuba and the United States. The Pichs Collection can actually be <a href=\"http://postalmuseum.si.edu/pichs/\" target=\"_blank\"><span class=\"s2\">viewed online</span></a>. In addition to these exhibitions, the institute also hosts performances, such as the Key West Film Festival and Songwriters, and displays the work of Cuban artists.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">Aside from Cuban history, the cultural center also features an exhibition on the history of the institution, which has a pretty interesting story in and of itself. In fact, the San Carlos Institute didn&rsquo;t always have the distinctly Cuban architecture that it&rsquo;s known for today. Originally, the cultural center was just a small wooden building on Anne Street. Although it moved locations a few years later, to Fleming Street, that building went up in flames in the Key West Fire of 1886. It wasn&rsquo;t until 1890 that the institute moved to its current spot on Duval. However, there were more building woes to come. In 1919 a hurricane decimated the San Carlos Institute. Left without a cultural center, the president of the San Carlos Institute, Jos&eacute; M. Renedo, went to Havana and petitioned the Cuban government for $80,000 to restore the San Carlos Institute. And restore it they did, to an unmatched Cuban splendor, with tiled walls, arched walkways, marble staircases and high ceilings. That said it&rsquo;s not by chance that the San Carlos Institute is often referred to as &ldquo;the jewel of Key West,&rdquo; for being one of the most beautiful buildings in The Keys.&nbsp;</span></p>\n<p class=\"p2\">&nbsp;</p>\n<p class=\"p2\"><span class=\"s1\"><em>The San Carlos Institute is open from Sunday through Wednesday, 11 a.m. to 5:00 p.m., and Thursday through Saturday, 11 a.m. to 9:00 p.m., and located just a few blocks from the 24 North Hotel shuttle. Admission is always free. However, donations are accepted. For more information, consult the website.</em></span></p>","other_info":"<p>516 Duval St<br /> Key West, Florida 33040<br /> Phone: <strong>305-294-3887</strong><br /> Hours:<strong> Sunday &ndash; Wednesday 11:00 a.m. &ndash; 5:00 p.m.</strong><br /> <strong>Thursday &ndash; Saturday 11:00 a.m. &ndash; 9:00 p.m.</strong></p>","sort_order":10,"image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/sci-lst.jpg"},"detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/sci-large.jpg"}}