{"name":"Kino’s Sandal Factory","description":"<p class=\"p1\"><span class=\"s1\">Located just a few blocks from the 24 North Hotel shuttle, the historic Kino&rsquo;s Sandal Factory is one of the spots that truly embodies the \"Old Key West\".</span></p>","url":"/attractions/kinos-sandal-factory","about":"<p class=\"p1\"><span class=\"s1\">You&rsquo;ll know a Conch by his sandals &ndash; and every Conch owns at least one pair of Kino Sandals. Since 1966, <a href=\"https://kinosandals.com/\" target=\"_blank\"><span class=\"s2\">Kino&rsquo;s Sandal Factory</span></a> has been the [un]official sandal-maker of Key West, crafting the island&rsquo;s sandals by hand in their Old Town factory. Located just a few blocks from the 24 North Hotel shuttle, Kino&rsquo;s is one of the spots that truly embodies the &ldquo;Old Key West.&rdquo; Since 1966, locals and tourists alike have been swearing by them as the most comfortable sandals they own &ndash; and some of the most durable. It&rsquo;s not hard to find someone who is still wearing a pair or two from the 1970s.</span></p>\n<p class=\"p2\"><span class=\"s1\">That said, Kino&rsquo;s has long been a Key West landmark. It all started 50 years ago, when Roberto &ldquo;Kino&rdquo; L&oacute;pez and his wife Margarita left Cuba for a new life. With just $3,000 and a loan from the bank, they set up shop in Key West on Whitehead Street, and started to make the affordable, quality sandals that everyone raves about. Although the factory has expanded over the years, including a move to the current location on Fitzpatrick Street, Kino&rsquo;s has preferred to keep the business small to ensure quality. In fact, for many years Kino&rsquo;s wouldn&rsquo;t sell any shoe outside of Key West, keeping Kino sandals as the ultimate Conch souvenir. These days, Kino&rsquo;s does take special orders via mail, but even those who have ordered from afar agree, it&rsquo;s just better to go in.</span></p>\n<p class=\"p2\"><span class=\"s1\">If you&rsquo;re planning on doing some shopping during your trip to Key West, you&rsquo;ll do best to follow your nose. Before you even see Kino&rsquo;s Sandal Factory, you&rsquo;ll get a whiff of fresh leather and you&rsquo;ll know you&rsquo;re on the right track. Although first-time visitors often mistake Kino&rsquo;s for a shoe store, it&rsquo;s still very much a factory. Customers can try on shoes, but styles aren&rsquo;t on display like in other traditional shoe stores. Clients still have to go up to the counter to request particular sandals. And in true Key West fashion, new sandals are sorted by size in old beer boxes. However, while customers are waiting, they can watch the sandals being made right before their eyes.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">While the sandals are popular with the locals, they&rsquo;re also popular with tourists. Frankly, they make great souvenirs. Not only are they functional, but they&rsquo;ll always serve as a reminder of your trip to Key West. After all, Key West is the only place you&rsquo;ll find Kino&rsquo;s, not to mention a quality leather sandal for $20. But just remember, when buying for yourself or a friend, these sandals are made of genuine leather, and like any leather shoe, they do have to be broken in. However, once your Kino&rsquo;s are broken in, they&rsquo;re yours for life. And if you happened to buy more than you can carry, just take the 24 North Hotel shuttle back to your room; it&rsquo;s just around the corner from Kino&rsquo;s.</span></p>\n<p class=\"p2\"><span class=\"s1\"><em>Kino Sandal Factory is open Monday &ndash; Friday, from 8:30 a.m. to 5:30 p.m., Saturday from 9:00 a.m. to 5:30 p.m., and Sunday from 10:00 a.m. to 3:00 p.m.</em></span></p>","other_info":"<p>107 Fitzpatrick Street<br /> Key West, Florida 33040<br /> Phone: <strong>305-294-5044</strong> ext. <strong>5</strong><br /> Open: <strong>Monday-Friday 8:30 a.m. &ndash; 5:30 p.m.</strong><br /> <strong>Saturday 9:00 a.m. &ndash; 5:30 p.m.</strong><br /> <strong>Sunday 10:00 a.m. &ndash; 3:00 p.m.</strong></p>","sort_order":11,"image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/kino-lst.jpg"},"detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/kino-large.jpg"}}