{"name":"Audubon House and Botanical Gardens","description":"<p>&nbsp;<span class=\"s1\">The Audubon House and Botanical Gardens are like a walk back in time through Key West&rsquo;s rich history, and are just a short walk from the 24 North Hotel Shuttle</span></p>","url":"/attractions/audubon-house-and-tropical-gardens","about":"<p class=\"p1\"><span class=\"s1\">If the name Audubon rings a bell, chances are your mind will start conjuring up images of birds, much like John James Audubon himself.&nbsp; Best known for his study of American species of birds, Audubon devoted his life to not only studying birds, but painting them, too. Luckily for Key West much of his series on the island&rsquo;s native birds are on display at the <a href=\"http://audubonhouse.org/\" target=\"_blank\"><span class=\"s2\">Audubon House and Botanical Gardens</span></a>, located in Old Town just a short walk down Whitehead Street from the 24 North Hotel Shuttle.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">Although it is believed that Audubon did some of his sketches here, this was not the house of the famed John James Audubon. Instead, it was the residence of one of Key West&rsquo;s most adept wreckers, Captain John Huling Geiger. Built after the Great Havana Hurricane of 1846, this two-story American Classic Revival was (and still is) one of the finest houses on the island. Thanks to the Wolfson family, this historical house was saved from disrepair in the 1950s and restored as the Audubon House Museum you see today.</span></p>\n<p class=\"p2\"><span class=\"s1\">With its green shutters, white frame, and botanical gardens, the Audubon House is like a walk back in time through Key West&rsquo;s rich history. The home has been restored according to what historians believe it looked like in the mid to late 1800s, and inside you&rsquo;ll find period pieces, such as dresses, suits, furniture and china. There are also the original lithographs and watercolor paintings of Key West&rsquo;s endemic birds by Audubon himself, covering the walls of the house.</span></p>\n<p class=\"p2\"><span class=\"s1\">Outside, you&rsquo;ll find the botanical gardens, filled with numerous species of orchids, bromeliads, palms and crotons, all of which are labeled in the spirit of J. J. Audubon. The garden&rsquo;s koi pond and resident herrings make for a peaceful stroll on the garden&rsquo;s self-guided tour, while the outdoor kitchen gives visitors a glimpse back in time. Next to the garden is the Audubon House Gallery filled with select, limited editions of Audubon&rsquo;s life-size depictions of the 22 species of birds he documented in Key West. Art buyers can also choose from various frames to compliment their prints.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">Although Key West&rsquo;s Audubon House is well worth a visit in its own right, many people only discover the historic sight after a wedding or special event. In fact, over the years the home has become a popular venue for weddings, considering its picturesque scenes and lush garden. Nevertheless, the home remains one of our favorite hidden gems on the island, with its unique mix of history, art, and all-around class. Stop in during your tour of Old Town; the Audubon House is just a few minutes walk from the 24 North Hotel shuttle.</span></p>\n<p class=\"p2\"><span class=\"s1\"><em>The Audubon House and Botanical Gardens are open 365 days a year, from 9:30 a.m. to 4:15 p.m.</em></span></p>","other_info":"<p>205 Whitehead Street<br /> Key West, Florida 33040<br /> Phone: <strong>877-294-2470</strong><br /> Hours: <strong>Monday &ndash; Sunday 9:30 a.m. &ndash; 4:15 p.m.</strong></p>","sort_order":12,"image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/abg-lst.jpg"},"detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/abg-large.jpg"}}