{"name":"The Key West Lighthouse & Keeper’s Quarters Museum","description":"<p><span class=\"s1\">Just a short walk from the 24 North Hotel shuttle, the Key West Lighthouse Museum gives breathtaking views across the entire island. Another must-see attraction!</span></p>","url":"/attractions/key-west-lighthouse-museum","about":"<p class=\"p1\"><span class=\"s1\">The Key West Lighthouse is one Conch landmark with quite the history. Built on one of the highest points in Key West, about 14 feet above sea level, the landmark is not only a glimpse into the Old Key West, but one of the best views on the entire island. You may have to climb 88 steps, but there&rsquo;s no other view like the view from the <a href=\"http://www.kwahs.org/museums/lighthouse-keepers-quarters/history\" target=\"_blank\"><span class=\"s2\">Key West Lighthouse.</span></a> And considering it&rsquo;s located next to the </span><span class=\"s2\">Hemingway Home and Museum</span><span class=\"s1\">, a visit makes for an enriching afternoon on the same block, and just a short walk from the 24 North Hotel shuttle.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">Although the lighthouse is out of commission today, it had served the Key West community since 1825. While that fact may not be surprising in and of itself, what is surprising is that for much the lighthouse&rsquo;s 19</span><span class=\"s3\"><sup>th</sup></span><span class=\"s1\"> century history, it was maintained by a woman, Barbara Mabrity. In fact, Mabrity ran the lighthouse by herself for over 32 years, after taking over the lighthouse duties when her husband unexpectedly died. She saw the lighthouse through three hurricanes and faithfully kept the midnight oil burning through each of them.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">Yet the lighthouse you see today isn&rsquo;t the original. The original is somewhere at the bottom of the sea, courtesy of the Great Havana Hurricane of 1846. Being just 90 miles from Havana, this hurricane ended up devastating Key West, as well as Havana, and it took the original lighthouse with it. Somehow Mabrity survived. Unfortunately, many of those who fled to the lighthouse for protection during the storm were not so luckily. Fourteen of the Key West residents that sought shelter in the lighthouse were also taken to sea, including six of Mabrity&rsquo;s own children.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">Although the original was destroyed, Key West still needed a lighthouse to protect those at sea and prevent fatalities along the Florida Reef. So Stephen Mallory (the same Mallory of Mallory Square) lobbied Congress for funding, and by 1848, the new lighthouse was completed. Barbara Mabrity resumed her duties as keeper and tended to the lighthouse, climbing its 88 steps day in and day out until her death at age 82. If fact, any of the <a href=\"https://www.ghostsandgravestones.com/key-west/attractions.php\" target=\"_blank\"><span class=\"s2\">ghost stories</span></a> of the &ldquo;haunted&rdquo; Key West Lighthouse concern her. Many people swear they have seen Mabrity going up and down the stairs to check on the lights and keep watch over Key West waters. Ghost or no ghost, all reports are friendly.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">Luckily, no other hurricane has destroyed the rebuilt lighthouse, yet improvements have been made over the years, including the heightening of the tower. The Keeper&rsquo;s Quarters were also built in the 19</span><span class=\"s3\"><sup>th</sup></span><span class=\"s1\"> century, so the keeper&rsquo;s family could be more involved in the Key West community. These days, the lighthouse and keeper&rsquo;s quarters are open to the public for viewing, with the Keeper&rsquo;s Quarters now functioning as a museum. Exhibits include in-depth looks at the lighthouse&rsquo;s keepers, as well as early Key West photos and artifacts, and re-creations of historic Key West homes.&nbsp; Drop by while you&rsquo;re in Old Town, it&rsquo;s just straight down Whitehead Street from the 24 North Hotel shuttle stop at Mallory Square.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\"><em>The Key West Lighthouse and Keeper&rsquo;s Quarters are open from 9:30 a.m. to 4:30 p.m. everyday, except for Christmas.&nbsp;</em></span></p>","other_info":"<p>938 Whitehead Street<br /> Key West, Florida 33040<br /> Phone: <strong>(305) 294-0012</strong><br /> Hours: <strong>Open daily from 9:30 a.m. &ndash; 4:30 p.m.</strong></p>","sort_order":14,"image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/lhkq-lst.jpg"},"detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/lhkq-large.jpg"}}