{
  "name":"Ernest Hemingway Home and Museum",
  "description":"<p>Where a man feels at home, outside of where he’s born, is where he’s meant to go,” - Ernest Hemingway</p>",
  "image":{"url":"//cdn.traveltripper.io/site-assets/359_384_783/media/hemingway-lst.jpg"},
  "sort_order":4,
  "url":"/attractions/ernest-hemingway/",
  "about":"<p>“Where a man feels at home, outside of where he’s born, is where he’s meant to go,” said Ernest Hemingway in his memoir The Green Hills of Africa. </p>\n\n<p>Yet Key West must have been where Hemingway was meant to go in the 1930s. It was by pure chance that the author got stuck on the island. He wasn’t even planning on living in Key West. Instead, he was waiting for a car that got delayed en route from Cuba. However, it was in those few weeks that “Papa” fell in love with Key West, prompting him to make it his home from 1928 to 1939. </p>\n\n<p>Although Hemingway spent his first few years in Key West at the Casa Antigua on Simonton Street, the house in which he spent most of his Conch tenure was the iconic Spanish colonial at 907 Whitehead, better known as the <a href=\"http://www.hemingwayhome.com/\" target=\"_blank\">Hemingway Home and Museum</a>. Located minutes from the hotel shuttle stop, getting to the Hemingway Home and Museum is easy. It’s a leisure walk down Duval to this iconic piece of American history.</p>\n\n<p>With its bright, yellow shutters and rounded windows, two-story porch and black pillars, the Hemingway Home and Museum stands out for its famous resident, as well as for its architectural beauty and interior design. Much of the original furnishings are intact, including the writer’s assortment of antique 17th and 18th century Spanish furniture and his second wife Pauline’s exquisite chandelier collection. </p>\n\n<p>Built in 1851 by Asia Tift, the distinguished Spanish colonial had fallen into disrepair and a slew of back taxes by the time Ernest and Pauline found it in 1931. Nevertheless, they purchased the dilapidated mansion, and over the course of the 1930s restored the home to its previous elegance, accentuating its features and adding the small details that would make the Hemingway Home a national landmark. </p>\n\n<p>To this day, one of the most interesting details is the pool. Finished in the late 1930s, <a href=\"http://www.hemingwayhome.com/pool/\" target=\"_blank\">the Hemingway pool</a> is the most extravagant sight on the grounds. Measuring 24 feet wide, 60 feet long, and ranging from 5 to 10 feet deep, the pool was an unheard-of architectural feat in the 1930s. It also had an extravagant price tag, costing around $20,000 in 1937. Ernest often joked that Pauline had spent his last penny on the pool’s construction. Upon returning from a reporting stint in the Spanish Civil War, the author threw that “last” penny at her in jest. Naturally, Pauline had that penny cemented into the pool. </p>\n\n<p>While many of the details of the Hemingway Home and Museum can be attributed to Pauline’s discerning eye and stylish taste, some of the most popular attractions have nothing at all to do with architecture or history. Those popular attractions are the polydactyl <a href=\"http://www.hemingwayhome.com/cats/\" target=\"_blank\">Hemingway cats</a>. Descendants of Hemingway’s six-toed cat Snow White, these 50-something cats roam the grounds of the Hemingway Home and Museum, drinking from Papa’s most humorous souvenir, the Sloppy Joe’s urinal. Over the years they’ve become an integral part of the house and an imperative stop along the Hemingway tour. </p>\n\n<p>For a more in-depth look at the author’s Key West residence, schedule a tour with one of the museum guides. The Hemingway Home and Museum is open 365 days a year, from 9 a.m. to 5 p.m. Check the website for <a href=\"http://www.hemingwayhome.com/rates/\" target=\"_blank\">current tour pricing</a>. Cash only.</p>\n      ",
  "other_info":"907 Whitehead Street<br>\n                Key West, Florida 33040<br>\n                Phone: 305-294-1139<br>\n                Open daily 9 a.m. – 5 p.m.",
  "detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_783/media/hemingway-lg.jpg"}
}
