{
  "name":"Fort Zachary Taylor Historic State Park",
  "description":"<p>Known as Key West’s best beach, the Fort Zachary Taylor Historic State Park is as much of an outdoor excursion as it is a history lesson.</p>",
  "image":{"url":"//cdn.traveltripper.io/site-assets/359_384_783/media/fort-lst.jpg"},
  "sort_order":3,
  "url":"/attractions/fort-zachary/",
  "about":"<p> Known as Key West’s best beach, the <a href=\"http://www.fortzacharytaylor.com/index.html\" target=\"_blank\">Fort Zachary Taylor Historic State Park</a> is as much of an outdoor excursion as it is a history lesson. Situated on the west tip of the island, this Florida state park is easily accessed by car from Roosevelt Boulevard and Old Town Key West. In fact, considering that Fort Zachary Taylor is 54 acres in total, it’s best to take a car to move around the park at your own convenience. </p>\n\n<p>Although now a national historic landmark and state park, Fort Zachary Taylor was a <a href=\"http://www.fortzacharytaylor.com/park-and-fort.html\" target=\"_blank\">U.S. military fort and naval base</a> throughout much of the 19th and 20th centuries. Started in 1845, the fort faced various difficulties in construction and was not finished until 1866 – a construction period totaling over 20 years. When the Civil War broke out in 1861, Captain John Brannan ensured that the fort remained under Union control. It was during that time that the fort played an influential role in thwarting Confederate advances, impeding rebel supply ships from reaching port with its long-range cannons. And although Fort Zachary did not see much combat during the Civil War, it was a major player a few years later during the Spanish-American War, with many of the battles taking place at sea.</p> \n\n<p>Yet by 1947 the fort was out of military commission. However, in 1968, the fort was back in the spotlight after a major excavation revealed the largest collection of Civil War cannons ever discovered. In 1973, the fort was declared a national historic landmark, and today it’s best known as a state park - although it does get its fair share of tourists coming to see the cannons. </p>\n\n<p>Once inside the park, or Fort Zach, as the locals call it, one of the main attractions is <a href=\"http://www.fortzacharytaylor.com/beach.html\" target=\"_blank\">the beach</a>. Although Key West is known more for its snorkeling than its beaches, the Fort Zach beach is one that you will want to visit for both. Almost as if it were cut out of the rocks by nature itself, the Fort Zach beach is a little slice of heaven that’s still on the main island. Aquamarine waters and cerulean skies make for a picturesque compliment to the park’s rock-lined border. </p>\n\n<p>Those rocky waters also make for ideal snorkeling conditions, with schools of rainbow-colored fish swimming through the crevices. Even better is that the Florida Park Service <a href=\"http://www.fortzacharytaylor.com/beach.html\" target=\"_blank\">rents snorkels, fins, and rafts</a> at reasonable daily rates, making a trip to Fort Zach an excellent way to spend the day in nature without any hassles and without going far from the hotel. </p>\n\n<p>In addition to the beach at Fort Zachary, the state park also has bike paths and nature trails filled with the island’s native birds, wildlife and fauna. Guests can grill or picnic, or grab food from the <a href=\"http://www.fortzacharytaylor.com/cafe.html\" target=\"_blank\">Cayo Hueso Café</a>, named after the Spaniards’ original name for Key West. Many people also choose to exercise on the park grounds, due to its serene atmosphere. It’s the perfect day trip in Key West, and no matter how close Fort Zach is to the hotel and Old Town Key West, it will always feel miles away. </p>\n",
  "other_info":"601 Howard England Way<br>\n                Key West, Florida 33040<br>\n                Phone: 305-292-6713<br>\n                Park Hours: 8:00 a.m. to sunset<br>\n                Fortress Hours: 8:00 a.m. to 5:00 p.m.",
  "detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_783/media/fort-lg.jpg"}
}
