{
  "name":"Key West Historic Memorial Sculpture Garden",
  "description":"<p>This is the place to buff up on your Key West history.</p>",
  "image":{"url":"//cdn.traveltripper.io/site-assets/359_384_783/media/sculpture-lst.jpg"},
  "sort_order":5,
  "url":"/attractions/sculpture-garden/",
  "about":"<p>This is the place to buff up on your Key West history. Located next to Mallory Square and easily accessible from the hotel, the <a href=\"http://keywestsculpturegarden.org/\" target=\"_blank\">Key West Historic Memorial Sculpture Garden</a> pays tribute to the island’s most influential residents. From well-known figures such as Ernest Hemingway and Harry S. Truman to lesser-known trailblazers such as Sandy Cornish and Eduardo Gato, the sculpture garden gives an unparalleled insight to Key West’s colorful past through <a href=\"http://keywestsculpturegarden.org/bust.htm\" target=\"_blank\">36 life-like busts</a> sculpted by acclaimed artist <a href=\"http://www.jamesmastinart.com/\" target=\"_blank\">James Mastin</a>. </p>\n\n<p>Key West’s history is a varied one, with much of the island’s early success coming from shipwrecks and Cuban tobacco. These busts and their corresponding descriptions tell the story of Key West’s founding and growth despite the island’s isolation from the continental United States. For example, the main sculpture, “<a href=\"http://keywestsculpturegarden.org/sculpter.htm\" target=\"_blank\">The Wreckers</a>” commemorates Key West’s valiant first-responders who saved countless lives from peril along the reef. \n\n<p>Starting in the early 19th century, “wrecking” became a popular and lucrative profession in Key West. Without detailed maps and modern technology, at least one ship wrecked each week in the “uncharted territory” along the Florida Reef. Wreckers would watch day and night, waiting for a shipwreck. And while the wreckers’ work was honorable – they saved numerous lives –the hefty profits they turned from shipwrecked cargo were also a major perk for many, making Key West <a href=\"http://www.floridakeys.com/keywest/key-west-history.htm\" target=\"_blank\">the richest city in the United States</a> during the first half of the 19th century. </p>\n\n<p>While much of the garden is centered around the shared history of Key West and the wreckers, there are other stories to be told. The Key West Historic Memorial Sculpture Garden takes a personal look at the individuals that impacted Key West and tells their own stories. One of the most compelling stories is that of <a href=\"http://www.thewakullanews.com/content/story-sandy-cornish\" target=\"_blank\">Sandy Cornish</a>, a former slave that became one of Key West richest residents.</p> \n\n<p>Born a slave, Cornish worked over the span of nine years to save enough money to buy his freedom. Yet when his freedom papers were destroyed in a fire, it didn’t take long before several slave-catchers tried to sell him in New Orleans. Yet Cornish would not return to slavery. Instead, he mutilated himself so badly on the selling block that no one wanted to buy him. Once Cornish recuperated, he and his wife Lillah started farming on Key West, selling fruits and vegetables to the locals. Their business grew so well that they not only became one of the richest families on the island, but prominent figures in Key West and the local black community, as well. In fact, they founded the Cornish Chapel of the African Methodist Episcopal Church, which is still intact at 702 Whitehead Street. </p>\n\n<p>Another Key West pioneer honored at the Historic Memorial Sculpture Garden is Eduardo Gato. A driving force behind the success of Key West’s tobacco industry, Gato revolutionized the cigar business on the island. Seeing a need for hard-working and loyal cigar rollers, Gato built comfortable houses near his factory to entice better employees. His strategy worked, and the Key West cigar industry took off, bringing Key West an economic prosperity unmatched in the United States at the time. Yet that wasn’t all Gato did for the Key West community. He also built the first fire-proof cigar factory and was a major financier of the Cuban fight for independence from Spain. </p>\n\n<p>For more untold Key West stories, visit the sculpture garden. You’ll be pleasantly surprised at the knowledge you pick up.</p>\n",
  "other_info":"401 Wall Street<br>Key West, Florida 33040<br>Open daily 7:30 a.m. – 9 p.m.",
  "detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_783/media/scuplture-lg.jpg"}
}
