{"name":"Harry S. Truman Little White House","description":"<p>&nbsp;<span class=\"s1\">Located in the heart of Old Town, Harry S Truman's Little White House is just a short walk from the 24 North Hotel Shuttle stop at Mallory Square Key West.</span></p>","url":"/attractions/harry-s-truman-little-white-house","about":"<p class=\"p1\"><span class=\"s1\">Washington D.C. isn&rsquo;t the only American city to have a White House. Key West has one too - in the <a href=\"https://www.nps.gov/nr/travel/presidents/trumans_little_white_house.html\" target=\"_blank\"><span class=\"s2\">Truman Little White House</span></a>. Made famous by the 33</span><span class=\"s3\"><sup>rd</sup></span><span class=\"s1\"> President of the United States, Harry S. Truman, the Little White House was where he spent 175 days of his presidency, from 1946 to 1952. Located among many of Old Town&rsquo;s most famous <a href=\"http://www.24northhotel.com/attractions/\" target=\"_blank\"><span class=\"s2\">attractions</span></a>, this historical site is not only a straight walk from the 24 North Hotel Shuttle stop at Mallory Square, but sure to pique the interest of any American history lover.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">Although Truman wasn&rsquo;t the first president to use the complex as the acting White House outside of D.C., he was the president to use it most often. Originally located on the water, this two-story &ldquo;white&rdquo; house on Front Street became the president&rsquo;s winter home and the official headquarters of the Executive Office when Truman was away from Washington. While Truman quickly fell in love with Key West, that wasn&rsquo;t the reason he migrated south in the first place. Instead, those were his doctor&rsquo;s orders.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">As you may recall, Truman had some heavy decisions on his plate in his first and second term in office. There was the stress of World War II and the first use of nuclear weapons; and then, there was the aftermath. It&rsquo;s no surprise that after the war ended, Truman was exhausted - and sick, according to his doctor. So when his doctor ordered him to a <a href=\"https://www.trumanlittlewhitehouse.com/key-west/history-little-white-house-museum.htm\" target=\"_blank\"><span class=\"s2\">warmer climate</span></a>, Key West and the Little White House were an easy choice. Truman loved the Key West climate and small-town feel. While in office he visited the Little White House a total of 11 times, and even after he retired from office he came back to visit five more times.</span></p>\n<p class=\"p2\"><span class=\"s1\">During his tenure at the Little White House, Truman oversaw both important national and international issues, such as the Marshall Plan, the Truman Doctrine, and the Fifth Civil Rights Executive Order, signing each document, &ldquo;The White House, US Naval Station, Key West, Florida.&rdquo; However, the Little White House wasn&rsquo;t all work and no play. The house was host to lively poker games and fishing trips with Truman cabinet members and foreign officials. In fact, the original custom-made poker table is still at the residence, as well as most of the original furniture from the 1949 remodelation &ndash; something that is always of particular interest to visitors.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">Today, the Little White House is open to the public 7 days a week, 365 days a year. The tours are especially worthwhile, considering the expert guides on site that give fascinating insight to the personal life of the president, and the military history of Key West. And although the house is a main attraction, don&rsquo;t forget to stop by the on-site botanical gardens, both of which are just a short distance from 24 North Hotel.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\"><em>The Harry S. Truman Little White House is open from 9:00 a.m. to 4:30 p.m.</em></span></p>","other_info":"<p>111 Front Street Key West,<br /> Florida 33040<br />  Phone: <strong>305-294-9911</strong><br /> Hours: <strong>Open daily, from 9:00 a.m. to 4:30 p.m.</strong></p>","sort_order":13,"image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/lwh-lst.jpg"},"detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/lwh-large.jpg"}}