{"name":"Cayo Hueso y Habana Historeum","description":"<p><span class=\"s1\">If you&rsquo;re looking for a Cuban experience in Key West, Cayo Hueso y Habana Historeum should be high on your list! Located at the 24 North Hotel shuttle stop.</span></p>","url":"/attractions/cayo-hueso-habana-historeum","about":"<p class=\"p1\"><span class=\"s1\">If you&rsquo;re looking for the Cuban experience in Key West, <a href=\"https://www.historictours.com/keywest/cayoh.php\" target=\"_blank\"><span class=\"s2\">Cayo Hueso y Habana Historeum</span></a> should be on your list. Located in Mallory Square and just in front of the 24 North Hotel shuttle stop, this attraction brings some of Cuba&rsquo;s finest traditions to Key West. Inside this unassuming red brick building, you&rsquo;ll find yourself transported to another world, one filled with art, history, cigars, spices, salsa, and authentic Cuban cuisine.</span></p>\n<p class=\"p2\"><span class=\"s1\">A reference to Key West&rsquo;s Spanish name, Cayo Hueso y Habana Historeum is a tangible representation of the island&rsquo;s Latin heritage. Led by conquistador Ponce de Le&oacute;n, it was the Spanish who discovered Key West. And although Spanish Florida was eventually ceded to the United States, the island has always retained a distinctly Spanish influence, aided by its proximity to Havana and the island&rsquo;s influx of Cuban residents in the mid-1800s. In fact, Key West&rsquo;s owes its strong affinity for cigars to Cuba. When the Spanish Crown decided to increase taxes on cigar makers in Cuba, they set up shop in Key West and the rest was history.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">The Cayo Hueso y Habana Historeum is a reflection of that history. The walls of this cultural center are covered with photos of Cuba&rsquo;s native sons and daughters, the stories of the island nation&rsquo;s fight for independence, and the country&rsquo;s legacy on Cayo Hueso. In the center of the historeum is <a href=\"http://www.elmesondepepe.com/menu/\" target=\"_blank\"><span class=\"s2\">El Meson de Pepe</span></a>, a restaurant serving some of Key West&rsquo;s most famous Cuban food and island cuisine. It&rsquo;s not just tourist hype either; <a href=\"http://www.10best.com/awards/travel/best-cuban-sandwich-in-florida/\" target=\"_blank\"><span class=\"s2\">USA Today</span></a> even rated the restaurant&rsquo;s Cayo Hueso Cuban Mix sandwich as their 2016 Reader&rsquo;s Choice. Yet people also rave about the <em>lech&oacute;n asado</em>, a slow-roasted pork and the <em>ropa vieja</em>, a spiced, shredded beef, which are both traditional Cuban dishes. When you&rsquo;re done eating you can drop by Abuela&rsquo;s Bodega where you can stock up on Cuban and Caribbean ingredients for your pantry at home.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">On the restaurant&rsquo;s outdoor patio there&rsquo;s almost always a live band playing salsa. Expect to dance. Whether it&rsquo;s the Latin beats or the rum in your mojitos, one of which is bound to catch up to you, and get you moving. Even if you don&rsquo;t know how to dance salsa, just go with it. After all, it&rsquo;s Key West &ndash; no judgment here. Also on the patio you&rsquo;ll find the entrance to <a href=\"http://www.cigarcityusa.com/\" target=\"_blank\"><span class=\"s2\">Cigar City USA</span></a>, which boasts the biggest selection of cigars on the island. Stop in to watch the cigar-makers hand roll their cigars right in front of your eyes, and take some home with you as well. This is one spot that knows how to live the good life. Once you&rsquo;ve ate, drank, smoked, and danced until you can&rsquo;t anymore, just walk outside to the 24 North Hotel shuttle stop (also located at Mallory Square) and we&rsquo;ll take you back.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\"><em>The Cayo Hueso y Habana Historeum is located in Mallory Square and open daily from 11:00 a.m. to 10:00 p.m.</em></span></p>","other_info":"<p>410 Wall Street (Mallory Square)<br /> Key West, Florida 33040<br /> Phone: <strong>305-295-2620</strong><br /> Hours: <strong>Open daily from 11:00 a.m. &ndash; 10:00 p.m.</strong></p>","sort_order":15,"image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/chh-lst.jpg"},"detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/chh-large.jpg"}}