{"name":"Mel Fisher Maritime Heritage Museum","description":"<p>&nbsp;<span class=\"s1\">The Mel Fisher Maritime Heritage Museum, located down the street from the 24 North Hotel shuttle stop, is another must-see attraction during your Key West vacation!</span></p>","url":"/attractions/mel-fisher-maritime-heritage-museum","about":"<p class=\"p1\"><span class=\"s1\">If you&rsquo;ve always wanted to dive for sunken treasure, Mel Fisher is a man after your own heart. Most famous for the discovery of the sunken Spanish galleon <em>Nuestra Se&ntilde;ora de Atocha</em>, <a href=\"http://www.melfisher.com/default.html\" target=\"_blank\"><span class=\"s2\">Mel Fisher</span></a> has made quite a fortune recovering the ship&rsquo;s long lost treasure. Although some of that treasure has been sold to the highest bidder, much of it is still on display (and in some cases, for sale) at the Mel Fisher Maritime Heritage Museum, which is one of <a href=\"http://www.24northhotel.com/attractions/\" target=\"_blank\"><span class=\"s2\">the many museums</span></a> located down the street from the 24 North Hotel shuttle stop.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">Since 1985, Mel Fisher and his crew have discovered hundreds of thousands of <a href=\"http://www.atochastory.com/\" target=\"_blank\"><span class=\"s2\">gold and silver</span></a> coins and emeralds in the ship&rsquo;s wreckage. However, it wasn&rsquo;t by chance that Fisher happened upon the wreckage of the 1622 Spanish fleet off the coast of Key West near the Dry Tortugas. Fisher and his family and crew searched for 16 years before finding the main pile of silver bars from the wrecked <em>Atocha</em>. He even lost his son, daughter-in-law, and crewmember in the search.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">However, Mel Fisher&rsquo;s is not only a place to see buried treasure, it&rsquo;s also the place to get an intriguing history lesson. The story goes that 1622 Spanish fleet en route to Spain encountered a hurricane which wrecked multiple galleons in the fleet, one being the designated treasure ship, the <em>Nuestra Se&ntilde;ora de Atocha</em>. Only five people survived the wreck, because they were able to hold on to the stump of the mizzenmast. And although rescuers marked the site of the wreck, a second hurricane hit a month later and sent any trace of the wreck into oblivion.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">It&rsquo;s these stories you&rsquo;ll hear at the museum, along with an in-depth history of the fleet and the conservation efforts of its sunken treasure. In fact, the Mel Fisher Maritime Heritage Society (the non-profit associated with the museum) has an extensive <a href=\"http://www.melfisher.org/conservation.htm\" target=\"_blank\"><span class=\"s2\">conservation laboratory</span></a> dedicated to preserving all of the recovered treasure. The lab is also open to the public, but it is separate from the museum. As a perk, the museum offers a discount on admission if you visit both on the same day.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">However, the 1622 Fleet is not the only exhibition at the Mel Fisher Museum worth viewing. The museum also has another permanent exhibition, &ldquo;A Slave Ship Speaks: The Wreck of the <em>Henrietta Marie</em>&rdquo;. Discovered by Fisher and his crew while searching for the treasures of the <em>Atocha</em>, the <em>Henrietta Marie</em> was an English slave ship that sunk off the coast of Key West in 1700. Being the only recorded slave ship to have sunk in the Americas, it is one of the few original sources historians have of the triangular slave trade.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">Considering the magnitude of this finding, the museum collaborated with the nation&rsquo;s leading historians to create a thoughtful exhibit examining our nation&rsquo;s past and its effect on our present. On display are rare artifacts recovered from the wreckage on, such as iron shackles, ivory &ldquo;elephants&rsquo; teeth,&rdquo; Venetian glass beads, and English pewter utensils. To see this exhibit and more, visit the Mel Fisher Museum in Mallory Square, both located next to the 24 North Hotel shuttle stop.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\"><em>The Mel Fisher Heritage Museum is open Monday through Friday, from 8:30 a.m. to 5:00 p.m., and Saturdays, Sundays and holidays, from 9:30 a.m. to 5:00 p.m. The conservation lab is open Monday through Friday, 11:30 a.m. to 2:00 p.m., and closed on holidays.&nbsp;</em></span></p>","other_info":"<p>200 Greene Street<br /> Key West, Florida 33040<br /> Phone: <strong>305-294-2633</strong><br /> Hours: <strong>Monday &ndash; Friday 8:30 a.m. &ndash; 5:00 p.m.</strong><br /> Saturday &ndash; <strong>Sunday 9:30 a.m. &ndash; 5:00 p.m</strong></p>","sort_order":14,"image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/mfmm-lst.jpg"},"detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/mfmm-large.jpg"}}