{"name":"The Key West Butterfly and Nature Conservatory","description":"<p><span class=\"s1\">The Key West Butterfly and Nature Conservatory might be the most peaceful spot on Duval Street and is just a short stroll from the 24 North Hotel shuttle stop.</span></p>","url":"/attractions/key-west-butterfly-and-nature-conservatory","about":"<p class=\"p1\"><span class=\"s1\">The Key West Butterfly and Nature Conservatory might be the most peaceful spot on Duval Street.&nbsp; A short walk from the 24 North Hotel shuttle, this <a href=\"http://www.keywestbutterfly.com/\" target=\"_blank\"><span class=\"s2\">butterfly conservatory</span></a> is a true gem. Hidden behind the fa&ccedil;ade of a historic Key West home is a Victorian-style greenhouse, home to hundreds of butterflies from all over the world. From monarchs and swallowtails to the more uncommon species in North America, like the blue morpho and its intoxicating shade of blue, this attraction is truly an exotic experience. In fact, there are over 50 different species of butterflies at the Key West Butterfly and Nature Conservatory. Considering that some come out in the morning and others in the afternoon, it&rsquo;s likely you won&rsquo;t see all of them if you only spend a few hours here.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">Yet time does have a way of flying. With its waterfalls and soft meditative music flowing in the background, this local butterfly sanctuary is just that &ndash; a sanctuary. Enclosed in a tropical garden, it feels a million miles away from the bars and tourists roaming Duval. But the conservatory isn&rsquo;t just home to butterflies. This greenhouse is also a refuge for tropical birds and exotic flora and fauna. There are even several flamingos on the grounds, as well as turtles likely cross your path.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">While the butterfly conservatory is ideal for a relaxing morning or afternoon, it&rsquo;s also good for those who want to brush up on their butterfly knowledge at the site&rsquo;s Learning Center. Here you can learn about the butterflies&rsquo; countries of origin, their development and their flight patterns. There&rsquo;s also a world map denoting the butterflies&rsquo; origins, as well as a more in-depth look at the beloved monarch migration. For those interested in seeing the butterflies before they become butterflies, the center also has live caterpillar feeding.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">However, one of the best things about the Key West Butterfly and Nature Conservatory is that although it&rsquo;s butterflies are from all over the world, they are not captured from the wild and then relocated to Key West. Instead, all of the butterflies in the conservatory have been farmed; and most of them come from butterfly farms in various rainforests across the world, providing a sustainable alternative to other economic activities in these areas.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">And for the more artistically inclined visitors, there is a gallery on site. However this isn&rsquo;t your typical gallery lined with canvases and oils. This is butterfly art - literally. The creative brainchild of Sam Trophia, this butterfly gallery is aptly named &ldquo;Wings of Imagination.&rdquo; Here, the Key West Butterfly and Nature Conservatory founder takes butterflies that died naturally and preserves them through artwork. These displays are definitely some of the most unique souvenirs you&rsquo;ll find in Key West.&nbsp; To get an idea of his vision, some examples are <a href=\"http://www.wingsofimagination.com/smallbutterflies.htm\" target=\"_blank\"><span class=\"s2\">online</span></a>.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">That said, if relaxation is what your seeking, but you still want to get out and see some of <a href=\"http://www.24northhotel.com/attractions/\" target=\"_blank\"><span class=\"s2\">Key West&rsquo;s attractions</span></a>, the Key West Butterfly and Nature Conservatory is an excellent option.&nbsp; Even better, the price of one day&rsquo;s admission is good for the entire day, so you can leave and come back before making the short walk back to the 24 North Hotel shuttle.</span></p>\n<p class=\"p2\"><span class=\"s1\"><em>The Key West Butterfly and Nature Conservatory is open daily from 9:00 a.m. to 5:00 p.m. However, the conservatory does not sell tickets after 4:30 p.m.</em>&nbsp;</span></p>","other_info":"<p>1316 Duval Street,<br /> Key West, Florida 33040<br /> Phone: <strong>305-296-2988</strong><br /> Hours:<strong> Open Daily 9:00 a.m. &ndash; 5:00 p.m.</strong></p>","sort_order":15,"image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/bnnc-lst.jpg"},"detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/bnnc-large.jpg"}}