{"name":"Cuban Coffee Queen","description":"<p>&nbsp;<span class=\"s1\">We take our coffee seriously in Key West! Cuban Coffee Queen is right next to the 24 North Hotel shuttle stop, which makes for the perfect start to your trip</span></p>","url":"/attractions/cuban-coffee-queen/","about":"<p class=\"p1\"><span class=\"s1\">We take our coffee seriously in Key West, especially our Cuban coffee. While there might be many imitations on the island, <a href=\"http://www.cubancoffeequeen.com/\" target=\"_blank\"><span class=\"s2\">Cuban Coffee Queen</span></a> is one spot where you can go for authentic Cuban coffee. One of our favorites in town, this little hole-in-the wall not only serves up one of the best caf&eacute;s con leche, but also some delicious sandwiches. However, what&rsquo;s even sweeter is its location. Cuban Coffee Queen is on the water and next to the 24 North Hotel shuttle stop, which makes for the perfect start or end to your Old Town exploring.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">Made with Caf&eacute; Domino, the espresso from Cuban Coffee Queen is the real deal. Choose from Cuban specialties like the caf&eacute; con leche, prepared with steamed milk; the bucci, i.e. Cuban espresso; or the colada, which is espresso with pure cane sugar. Other concoctions by Cuban Coffee Queen include Cuban vanilla coffee, &ldquo;gringo&rdquo; coffee and caramel coffee. However, considering the Key West sunshine, most people opt for the caf&eacute; con leche over ice, which is especially good here. The secret?&nbsp; They make their ice cubes with coffee &ndash; and it makes all the difference. No longer will you have to sacrifice caffeine in your iced coffee.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">If you&rsquo;re stopping by in the morning, order the Key Wester, which is one of the spot&rsquo;s most famous breakfast sandwiches. Made with eggs, American cheese, and your choice of mojo pork, bacon, ham or chorizo, the Key Wester doesn&rsquo;t disappoint. However, there&rsquo;s also breakfast burritos, croissants, Cuban toast and guava marmalade, and fruit smoothies. Although the original spot doesn&rsquo;t have tables and chairs, it is next to the water, which translates to gorgeous views and quite possibly the best start to your morning.&nbsp;</span></p>\n<p class=\"p2\"><span class=\"s1\">And then there are the sandwiches. These you have to try. Made with a generous helping of Cuban-style pork, these sandwiches are enough to feed two. Some favorites include the traditional Cuban Mix on sweet, pressed Cuban bread, filled with mojo pork, ham, Swiss cheese, pickles, mayo, mustard and lettuce. If you&rsquo;re a bacon-lover, get the Cuban Queen Mix with three meats, American cheese and bacon, lettuce and tomato. However, if you like your sandwich with a kick, consider the Jos&eacute; Mart&iacute; or the Caliente Cuban Mix. The Jos&eacute; Mart&iacute; adds provolone and horseradish, while the Caliente Cuban Mix offers pepper jack cheese and jalepe&ntilde;os. Either way, they&rsquo;re all mouth-watering.</span></p>\n<p class=\"p2\"><span class=\"s1\">But aside from the strong coffee and great sandwiches, there are several other reasons we keep coming back. Cuban Coffee Queen is <a href=\"http://www.nytimes.com/2015/02/08/travel/in-key-west-a-taste-of-cuban-coffee-culture.html?_r=0\" target=\"_blank\"><span class=\"s2\">consistently good</span></a>. No matter how long the lines are (and yes, there are lines in high season), the quality remains the same. It&rsquo;s also quite the reasonably priced breakfast or lunch, which as you probably know, is not always the case in Key West. We also love that the portions are generous, which makes Cuban Coffee Queen ideal for sharing with friends and family. It&rsquo;s a local&rsquo;s spot in the heart of Old Town, and the perfect stop for breakfast or lunch in close proximity to 24 North Hotel.</span></p>\n<p class=\"p1\"><span class=\"s1\"><em>For more menu options, consult the menu. There is a second location in downtown Key West at Key Lime Square, yet we tend to be fond of the original.</em></span></p>","sort_order":9,"other_info":"<p class=\"p1\">284 Margaret Street<br /> Key West, Florida 33040<br /> Phone: <strong>305-292-4747</strong><br /> Hours: <strong>Open daily from 6:30 a.m. to 7:00 p.m.</strong></p>","image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/ccq-lst.jpg"},"detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/ccq-large.jpg"}}