{"name":"Southernmost Point Buoy","description":"<p>Easily Key West&rsquo;s most photographed spot, the Southernmost Point Buoy is one of those landmarks that you can&rsquo;t overlook when in the Conch Republic.</p>","url":"/attractions/southernmost-point-buoy/","about":"<p>Easily Key West&rsquo;s most photographed spot, the&nbsp;<a href=\"http://www.cityofkeywest-fl.gov/egov/apps/locations/facilities.egov?view=detail;id=79\" target=\"_blank\">Southernmost Point Buoy</a>&nbsp;is one of those landmarks that you can&rsquo;t overlook when in the Conch Republic. Like the name suggests, the buoy does mark the southernmost point in the continental United States &ndash; well, almost. Technically, the true southernmost point in the country is the privately owned Ballast Key. But this is Key West, where we&rsquo;re not about technicalities. Still, people from all over the world line for their photos in front of Key West&rsquo;s Southernmost Point. Located just south of the 24 North Hotel shuttle at the intersection of Whitehead and South Streets, this is an obligatory stop during your trip to Key West and an obligatory photo op, as well.</p>\n<p>The&nbsp;<a href=\"http://www.atlasobscura.com/places/southernmost-point-of-the-usa\" target=\"_blank\">Southernmost Point Buoy</a>&nbsp;also denotes another source of Key West pride &ndash; its proximity to Cuba. As the buoy and the slogan state, Key West is &ldquo;90 miles to Cuba,&rdquo; even if it&rsquo;s really a little more. Although Key West is actually 94 miles to Cuba, &ldquo;90 miles to Cuba&rdquo; has a much nicer ring to it. After all, what are a few miles when you&rsquo;re on island time? Nevertheless, it&rsquo;s a nod to Cuba and Key West&rsquo;s shared history. In fact, it was much easier for Conchs to get to Havana than the United States before the construction of the causeway. Back then those 90 miles to Cuba seemed like a lot less than the trip to the mainland United States, prompting Key Westers to travel back and forth to Havana for shopping, nightlife, and to visit relatives. Of course, that all changed with the Cuban Revolution, but there was a time, and we at 24 North especially like to recall it.</p>\n<p>Although the Southernmost Point Buoy is one reminder of that history, it also helps create new histories. As the &ldquo;unofficial&rdquo; photo studio on the island, it&rsquo;s just one of those things you have to do when in Key West. And fortunately for the photo-takers, the landmark is now much more photogenic than it used to be. It&rsquo;s also more &ldquo;grounded&rdquo; than the previous markers. According to&nbsp;<a href=\"http://www.keywesting.com/key-west-information/key-west-history/11-southernmost-point\" target=\"_blank\">local Conch lore</a>, the Southernmost Point used to be a rather dilapidated sign that people had fun stealing. These days, it&rsquo;s impossible to steal the buoy - it&rsquo;s way too heavy. However, the story goes that in 1984 the City of Key West was trying to move a heavy concrete sewer junction and couldn&rsquo;t. Inspiration struck, and the new landmark was born.</p>\n<p>Since then, the Southernmost Point Buoy has made for more picturesque photos, but the lines remain the same. They won&rsquo;t always be long, but there will always be people. So if you&rsquo;re interested in capturing a photo memory of your stay in Key West, your best bet is to go in the early morning before visiting many of Key West&rsquo;s&nbsp;<a href=\"http://www.24northhotel.com/attractions/\" target=\"_blank\">other great attractions</a>, or around the time of the sunset celebration, as many of the crowds tend to disperse. You can check the&nbsp;<a href=\"http://southernmostpointwebcam.com/\" target=\"_blank\">webcam</a>&nbsp;to get an idea of the traffic in real time and take the 24 North Hotel shuttle to get there, as the Southernmost Point is just a short distance from the hotel.</p>","sort_order":8,"image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/smp-lst.jpg"},"detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_820/media/smp-large.jpg"},"other_info":"<p>Whitehead St &amp; South St<br /> Key West, FL 33040<br /> Hours: Open 24 hours a day, 365 days a year</p>"}