{
  "name":"Rodriguez Cigar Factory",
  "description":"<p>On a little side street off Duval, you’ll find the only cigars in Key West worthy of a Cuban name. That’s because Rodriguez Cigars are, in fact, Cuban.</p>",
  "image":{"url":"//cdn.traveltripper.io/site-assets/359_384_783/media/ciggar-lst.jpg"},
  "sort_order":7,
  "url":"/attractions/rodriguez-cigar/",
  "about":"<p>On a little side street off Duval, you’ll find the only cigars in Key West worthy of a Cuban name. That’s because <a href=\"http://www.rodriguezcigarskeywest.com/\" target=\"_blank\">Rodriguez Cigars</a> are, in fact, Cuban. </p>\n\n<p>The story of these cigars begins in Siguaney, Cuba, with Angel and Daniella Rodriguez. It was 1947, and Angel and Daniella had just planted their first tobacco crop on their private plantation, La Finca de Carmencita. As time went along, more and more cigar manufacturers began to buy their tobacco, and the business boomed. </p>\n\n<p>Then came the Cuban Revolution. The government nationalized the tobacco industry and La Finca de Carmencita with it, leaving Angel and Daniella without their business. However, that was not the end of the <a href=\"http://www.rodriguezcigarskeywest.com/our-story/\" target=\"_blank\">Rodriguez tobacco business</a>. In 1971, the family moved to the United States, and by 1984, they had opened the Rodriguez Cigar Factory in Key West, revitalizing the family’s tobacco heritage. </p>\n\n<p>Despite being based in Key West, the Rodriguez Cigar Factory still adheres to the same techniques practiced in the family’s native Cuba, making its cigars some of the finest cigars produced in the United States, if not the world. Although sourcing Cuban tobacco is still impossible in the United States, Rodriguez Cigars sources tobacco from Nicaragua, which has a climate and soil composition very similar to that of Cuba. By picking prime tobacco, carefully curing the leaves, and meticulously rolling each cigar by hand, Rodriguez Cigars are able to preserve the superb Cuban quality rarely found outside the island nation.</p>\n\n<p>Yet the factory’s heritage isn’t the only thing Cuban about the cigars. The Rodriguez Cigar Factory storefront offers just the type of hospitality you would expect from a family-run business. Run by Danny DiFabio, <a href=\"http://www.rodriguezcigarskeywest.com/family-integration/\" target=\"_blank\">grandson of Angel and Daniella</a>, the Rodriguez Cigar Factory is welcoming and laid-back, reminiscent of the hospitality you encounter in Cuba. In fact, the Rodriguez Cigar Factory has made a name for itself on the island because of its personal attention.</p>\n\n<p>Before you know it, Danny will have a Cuban coffee in your hand and a cigar in the other. As you browse the walls of cigars at the storefront, he’ll give you the personal tour, and he’ll explain the finer points of the cigar business. He’ll offer personal recommendations in the process, ensuring that you find the <a href=\"http://www.rodriguezcigarskeywest.com/cigar-collection/\" target=\"_blank\">perfect cigar to suit your tastes</a>. After all, there’s something to be said about a cigar that can make it through a revolution, and even more to be said about one that can thrive after one. And that’s Rodriguez Cigars, the oldest cigar factory in Key West.</p>\n\n<p>The Rodriguez Cigar Factory in Old Town is less of a lounge and more of a store. However, if you are looking for a lounge, there is one of our personal favorites, the <a href=\"http://www.gateshotelkeywest.com/gates-hotel-key-west-hotel-partnerships/rodriguez-cigar-lounge-key-west/\" target=\"_blank\">Rodriguez Cigar Lounge</a>, located at our sister hotel The Gates, next door to 24 North Hotel. </p>\n",
  "other_info":"113 Fitzpatrick Street<br>\n\t\t\t\tKey West, Florida 33040<br>\n\t\t\t\tPhone: 305-296-0167<br>\n\t\t\t\tOpen daily 9:30 a.m. – 4:30 p.m.",
  "detail_image":{"url":"//cdn.traveltripper.io/site-assets/359_384_783/media/ciggar-lg.jpg"}
}
